In [1]:
import pandas as pd 
import numpy as np

In [2]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

## 인덱싱

In [3]:
# df['컬럼명']
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [4]:
df['eng'].sum()  #결과는 시리즈

160

In [5]:
df[['eng','math']] #복수개 컬럼 선택

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [6]:
df.eng # 권장사항x ==> df['eng'] (권장)

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [7]:
df.eng['a':'c']

a    10
b    30
c    50
Name: eng, dtype: int64

## 슬라이싱 : 인덱스(행,row)

In [8]:
df[1:4]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [9]:
df['b':'c']

   eng  kor  math
b   30   40    50
c   50   60    20

### iloc 속성(zero-base): iloc[행,열]

In [10]:
df.iloc[0] # 결과는 시리즈

eng     10
kor     20
math    90
Name: a, dtype: int64

In [11]:
df.iloc[0]['eng']  # 결과는 시리즈

10

In [12]:
df.iloc[0,0] # 0행 0열   # arr에서는 ==>  arr[행,열]

10

In [13]:
df.iloc[1:4]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [14]:
df.iloc[[0,2,3]]  # 0행 2행 3행  #복수개 인덱스

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [16]:
df.iloc[1:,1]  #[행,열]

b    40
c    60
d    80
Name: kor, dtype: int64

In [18]:
df.iloc[1:,1:]

   kor  math
b   40    50
c   60    20
d   80    70

In [24]:
df.iloc[[0,1,3],[0,2]]
df.iloc[[0,1,3],::2]

   eng  math
a   10    90
b   30    50
d   70    70

In [25]:
# 마지막 컬럼을 제외하고 선택
df.iloc[:,:-1]

   eng  kor
a   10   20
b   30   40
c   50   60
d   70   80

In [29]:
# 마지막 컬럼만 선택
df.iloc[:,[-1]]  #복수개 선택으로 넣어줘야 dataframe형식으로 출력

   math
a    90
b    50
c    20
d    70

### loc 속성(부여된 인덱스명,컬럼명): loc[행,열]

In [30]:
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [31]:
df.loc['a','eng']

10

In [32]:
df.loc['a':'c']

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [33]:
df.loc['a':'c','kor':]

   kor  math
a   20    90
b   40    50
c   60    20

In [36]:
df.loc[['a','b','d'],['eng','math']]
df.loc[['a','b','d'],::2]

   eng  math
a   10    90
b   30    50
d   70    70